{
    "title": "Project 3 Writeup",
    "sections": [
      {
        "heading": "Motivation",
        "paragraphs": [
          "EEG data can feel abstract and difficult to interpret. We wanted to make brain activity more tangible and visually intuitive. By exploring the data ourselves, we noticed how understanding improved when we visualized it physically—so we designed an interface that helps users do the same, making neural patterns more accessible through interactive exploration."
        ]
      },
      {
        "heading": "Design Rationale",
        "paragraphs": [
          "We used animated bubbles on a 3D brain to represent channel intensity—bubbles grow or jitter more when signals vary rapidly. This movement-based encoding helped communicate activity levels more intuitively than static color or size alone. Color was kept consistent across all views to preserve recognition, and we emphasized interaction: users can rotate the brain and zoom into any view. We skipped a legend for bubble size because zooming made it context-dependent.",
          "In the second tab, we included a multi-line plot with confidence intervals. While complex, it supports deeper comparison across channels. We made this optional to keep the main view clean and user-friendly. Dropdown filters help narrow focus to relevant participants or channels.",
          "Stylistically, we used a dark background with white cards to improve contrast and create a research-oriented visual identity."
        ]
      },
      {
        "heading": "Development Process",
        "paragraphs": [
          "We started by reviewing multiple datasets and picked EEG data based on team interest. Each member contributed exploratory visualizations for the checkpoint. Afterward, we switched to a new dataset for better creative flexibility.",
          "One member scaffolded the site, and tasks were split among frontend design, D3 implementation, and debugging. Each of us spent between 4-12 hours on the project. Time was mainly spent debugging interactivity and managing complex collaborative code.",
          "Major challenges included: designing interactions that add clarity (not clutter), managing large data and performance in D3, and fixing subtle visual or state bugs across tabs."
        ]
      }
    ]
  }